app/Controllers/Home.php

    public function index(){

        $session = session();
        $pages=$this->pages;

        $pages->select("pages.*,(SELECT COUNT(*) from page_links where page_id=pages.id) as total_links")
                ->where("user_id",$session->id);

        $data=[];
        $data["username"]=$session->username;
        $data['pages']=$pages->paginate(10);
---
SELECT COUNT(*) AS `numrows`
FROM `pages`
WHERE `user_id` = '1'