app/Controllers/Login.php

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `username` = 'gtc'
INSERT INTO `users` (`username`, `password`) VALUES ('gtc', 'f0578f1e7174b1a41c4ea8c6e17f7a8a3b88c92a')
---
    public function register_user(){ //Add a user

        $username=trim($this->request->getPost('username'));
        $password=sha1(trim($this->request->getPost('password')));

        $users=new UsersModel();

        $isUsr=$users->where(["username"=>$username])->countAllResults();

        $response=[
                "status"=>0,
                "data"=>""
            ];

        if($isUsr==0){ //if username doesn't exist create user
            $nusr=$users->insert(["username"=>$username,"password"=>$password]);