app/Controllers/Page.php

    public function index($id){
        $data=[];
        $data['page']=$this->pages->find($id);
        $data['links']=$this->links->where(["page_id"=>$id])->paginate(10);
---
SELECT *
FROM `pages`
WHERE `pages`.`id` = '8'
SELECT *
FROM `page_links`
WHERE `page_id` = '8'
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `page_links`
WHERE `page_id` = '8'

    public function save(){ //Saves url given by the user
        $session = session();
        $response=[
                "status"=>0,
                "data"=>""
            ];
        $data=[]; //initialize de array for creating the page object
        $url=$this->request->getPost('url');
        $data["url"]=$url;
        $htlmCont=$this->getHtml($url);

        if($htlmCont!=""&&$htlmCont!=null){ //Check if URL returns content

            $htmlDom=new \DOMDocument();
            @$htmlDom->loadHtml($htlmCont); //converting htmltext to dom object with supress of errors for avoiding encoding issues

            $title = $htmlDom->getElementsByTagName("title");
            $name="";
            if($title->length > 0){
              $name=trim($title->item(0)->nodeValue);
            }

            $data["name"]=$name;
            $data["user_id"]=$session->id;

            $page=$this->pages->insert($data);
---
INSERT INTO `pages` (`url`, `name`, `user_id`) VALUES ('https://www.wingbuddy.com', 'Wingbuddy: Exceptional Travel Experiences', '1')

                    $dataLink["page_id"]=$page;
                    $dataLink["name"]=$name;

                    $this->links->insert($dataLink);
---
INSERT INTO `page_links` (`link`, `page_id`, `name`) VALUES ('tel:18552959200', 1, '1.855.295.9200')