app/Models/UsersModel.php

    public function userAuth($email,$password){
        $this->select('id')
                ->where(['username'=>$email,'password'=>$password]);
        $total_rows=$this->countAllResults();

        if($total_rows > 0) {
            $user=$this->get()->getResult();
---
SELECT *
FROM `users`
WHERE `username` = 'gtc'
AND `password` = 'f0578f1e7174b1a41c4ea8c6e17f7a8a3b88c92a'